#### CDKTF Diff 📋
<details><summary>Show Diff</summary>

```
Error
    at Object.Usage (/usr/local/lib/node_modules/cdktf-cli/bundle/bin/cmds/handlers.js:106:3020)
    at Sle (/usr/local/lib/node_modules/cdktf-cli/bundle/bin/cmds/handlers.js:509:1450)
    at unr (/usr/local/lib/node_modules/cdktf-cli/bundle/bin/cmds/handlers.js:509:1743)
    at async Qb (/usr/local/lib/node_modules/cdktf-cli/bundle/bin/cmds/handlers.js:509:1796)
    at async Object.wcr (/usr/local/lib/node_modules/cdktf-cli/bundle/bin/cmds/handlers.js:514:26022)
    at async wv.handleCommand (/usr/local/lib/node_modules/cdktf-cli/bundle/bin/cdktf.js:74:27780)
    at async Object.handler (/usr/local/lib/node_modules/cdktf-cli/bundle/bin/cdktf.js:74:15372) {
  __type: 'Usage'
}
route53_app1.ducloi.local  Initializing the backend...
route53_app1.ducloi.local  
                           Successfully configured the backend "s3"! Terraform will automatically
                           use this backend unless the backend configuration changes.
route53_app1.ducloi.local
route53_app1.ducloi.local
route53_app1.ducloi.local  Initializing provider plugins...
                           - Finding hashicorp/aws versions matching "5.45.0"...
route53_app1.ducloi.local  - Installing hashicorp/aws v5.45.0...
route53_app1.ducloi.local  - Installed hashicorp/aws v5.45.0 (signed by HashiCorp)

                           Terraform has created a lock file .terraform.lock.hcl to record the provider
                           selections it made above. Include this file in your version control repository
                           so that Terraform can guarantee to make the same selections by default when
                           you run "terraform init" in the future.
route53_app1.ducloi.local  Terraform has been successfully initialized!
                           
                           You may now begin working with Terraform. Try running "terraform plan" to see
                           any changes that are required for your infrastructure. All Terraform commands
                           should now work.

                           If you ever set or change modules or backend configuration for Terraform,
                           rerun this command to reinitialize your working directory. If you forget, other
                           commands will detect it and remind you to do so if necessary.
route53_app1.ducloi.local  - Fetching hashicorp/aws 5.45.0 for linux_amd64...
route53_app1.ducloi.local  - Retrieved hashicorp/aws 5.45.0 for linux_amd64 (signed by HashiCorp)
                           - Obtained hashicorp/aws checksums for linux_amd64; All checksums for this platform were already tracked in the lock file
route53_app1.ducloi.local  Success! Terraform has validated the lock file and found no need for changes.
route53_app1.ducloi.local  aws_route53_record._labducloilocal_A: Refreshing state... [id=Z04310523PE6MMFQSSP6Z_lab.ducloi.local_A]
route53_app1.ducloi.local  aws_route53_record._homeducloilocal_A: Refreshing state... [id=Z04310523PE6MMFQSSP6Z_home.ducloi.local_A]
route53_app1.ducloi.local  Terraform used the selected providers to generate the following execution
                           plan. Resource actions are indicated with the following symbols:
                             + create
                             - destroy

                           Terraform will perform the following actions:
route53_app1.ducloi.local    # aws_route53_record._devducloilocal_A (_dev.ducloi.local_A) will be created
                             + resource "aws_route53_record" "_devducloilocal_A" {
                                 + allow_overwrite = (known after apply)
                                 + fqdn            = (known after apply)
                                 + id              = (known after apply)
                                 + name            = "dev.ducloi.local"
                                 + records         = [
                                     + "14.226.250.205",
                                   ]
                                 + ttl             = 86400
                                 + type            = "A"
                                 + zone_id         = "Z04310523PE6MMFQSSP6Z"
                               }

                             # aws_route53_record._labducloilocal_A will be destroyed
                             # (because aws_route53_record._labducloilocal_A is not in configuration)
                             - resource "aws_route53_record" "_labducloilocal_A" {
                                 - fqdn                             = "lab.ducloi.local" -> null
                                 - id                               = "Z04310523PE6MMFQSSP6Z_lab.ducloi.local_A" -> null
                                 - multivalue_answer_routing_policy = false -> null
                                 - name                             = "lab.ducloi.local" -> null
                                 - records                          = [
                                     - "14.226.250.205",
                                   ] -> null
                                 - ttl                              = 86400 -> null
                                 - type                             = "A" -> null
                                 - zone_id                          = "Z04310523PE6MMFQSSP6Z" -> null
                               }

                             # aws_route53_record._tesducloilocal_A (_tes.ducloi.local_A) will be created
                             + resource "aws_route53_record" "_tesducloilocal_A" {
                                 + allow_overwrite = (known after apply)
                                 + fqdn            = (known after apply)
                                 + id              = (known after apply)
                                 + name            = "tes.ducloi.local"
                                 + records         = [
                                     + "14.226.250.205",
                                   ]
                                 + ttl             = 86400
                                 + type            = "A"
                                 + zone_id         = "Z04310523PE6MMFQSSP6Z"
                               }

                           Plan: 2 to add, 0 to change, 1 to destroy.
                           
                           ─────────────────────────────────────────────────────────────────────────────

                           Saved the plan to: plan

                           To perform exactly these actions, run the following command to apply:
                               terraform apply "plan"


```

</details>

*Pusher: @bnguyenvan, Action: `pull_request`, Workflow: `CDKTF Diff`*